{
  "copyright": "Todos los derechos reservados por copyright",
  "contact": "Contacto",
  "greetings": "Lista de productos",
  "companyName": "Sabor & Arte",
  "companyDescription": "Somos una empresa donde cocinar es nuestra pasión y nuestra comida se basa en una comida rica, abundante y casera.",
  "starter": "Entradas",
  "mainDish": "Platos Principales",
  "desserts": "Postres",
  "signingOut": "Cerrando sesión...",
  "goodbye": "¡Hasta pronto!",
  "signOut": "Cerrar sesión",
  "signIn": "Iniciar sesión",
  "signUp": "Registrarse",
  "cart": {
    "title": "Tu Carrito",
    "quantity": "Cantidad",
    "total": "Total",
    "emptyMessage": "Tu carrito está vacío.",
    "addButton": "+",
    "removeButton": "-",
    "emptyCartButton": "Vaciar Carrito",
    "checkoutButton": "Finalizar Compra",
    "toastAdded": "Se agregó {{titulo}} al carrito.",
    "toastRemoved": "Se quitó {{titulo}} del carrito."
  },
  "item": {
    "viewDetailsButton": "Ver detalle"
  },
  "itemCount": {
    "addToCartButton": "Agregar al Carrito",
    "toastAdded": "Se agregó {{count}} artículo(s) al carrito"
  },
  "itemDetail": {
    "backButton": "Volver"
  },
  "products": {
    "product_1": {
      "titulo": "Tacos",
      "descripcion": "Los tacos son un platillo mexicano popular que consiste en tortillas pequeñas, típicamente de maíz, rellenas de una variedad de ingredientes. Los rellenos clásicos incluyen carne asada, pollo, pescado, o carnitas, acompañados de cebolla, cilantro, y salsa fresca. Se pueden añadir otros complementos como guacamole, queso, o frijoles refritos. Los tacos destacan por su sabor intenso y su capacidad de personalización, siendo un alimento básico tanto en eventos informales como en comidas familiares."
    },
    "product_2": {
      "titulo": "Hamburguesa",
      "descripcion": "Las hamburguesas son un platillo clásico estadounidense que consiste en una hamburguesa de carne molida servida en un pan. La hamburguesa se sazona y se asa a la parrilla, luego se cubre con queso, lechuga, tomate, cebolla, pepinillos, y condimentos como ketchup y mostaza. Las hamburguesas son conocidas por su sabor jugoso y su versatilidad, con infinitas variaciones y complementos para satisfacer todos los gustos."
    },
    "product_3": {
      "titulo": "Empanadas",
      "descripcion": "Las empanadas son un tipo de pastelillo relleno que se puede encontrar en diversas culturas alrededor del mundo, pero son especialmente populares en Latinoamérica, España y Filipinas. Consisten en una masa exterior, que puede ser de harina de trigo o maíz, rellena con una variedad de ingredientes que varían según la región. Los rellenos típicos incluyen carne, pollo, queso, vegetales o mariscos, a menudo acompañados de cebolla, huevo duro, aceitunas y especias. Las empanadas se pueden hornear o freír."
    },
    "product_4": {
      "titulo": "Maracuyá",
      "descripcion": "El postre de maracuyá fusiona la frescura de la fruta de la pasión con la dulzura característica de la leche condensada y la textura suave de la crema. Este postre se ha ganado un lugar especial en la mesa de los amantes de los sabores tropicales."
    },
    "product_5": {
      "titulo": "Pizza",
      "descripcion": "Una pizza casera típica consiste en una base de masa crujiente y esponjosa, recién horneada, cubierta con una salsa de tomate rica y aromática. Sobre esta base se esparcen generosamente queso mozzarella derretido y dorado, y se complementa con ingredientes al gusto como rodajas de pepperoni, champiñones frescos, pimientos, albahaca, tomate fresco y cebolla. Este platillo es apreciado por su frescura y la posibilidad de personalizar los toppings según las preferencias de cada uno."
    },
    "product_6": {
      "titulo": "Tiramisú",
      "descripcion": "El clásico postre italiano que ha deleitado a las papilas gustativas durante generaciones. Capas de bizcochos de soletilla empapados en café, rica crema de mascarpone y una capa de cacao en polvo. El tiramisú es el final perfecto para cualquier comida, y se pueden encontrar variantes con sabor a chocolate, naranja, frambuesa e incluso con especias de calabaza."
    },
    "product_7": {
      "titulo": "Pollo",
      "descripcion": "Las patas de pollo al horno son un plato sencillo y delicioso, ideal para una comida reconfortante. Este plato consiste en patas de pollo marinadas en una mezcla de especias, hierbas y a veces un toque de jugo de limón o ajo, que luego se hornean hasta alcanzar una piel dorada y crujiente mientras el interior permanece jugoso y tierno. Las patas de pollo al horno se pueden servir con una variedad de guarniciones, como verduras asadas, puré de papas o una ensalada fresca, haciendo de esta receta una opción versátil para cualquier ocasión."
    },
    "product_8": {
      "titulo": "Tapas",
      "descripcion": "Las tapas gallegas son una exquisita selección de pequeños platos y aperitivos originarios de Galicia, en el noroeste de España. Se caracterizan por su diversidad y riqueza, incorporando productos del mar y del campo gallegos, destacando ingredientes como mariscos frescos, carnes curadas y quesos locales. Estas tapas no solo son deliciosas sino también una parte esencial de la cultura gastronómica gallega, ofreciendo una experiencia culinaria que invita a compartir y disfrutar en buena compañía."
    },
    "product_9": {
      "titulo": "Pasta",
      "descripcion": "Una pasta con salsa es un plato clásico y reconfortante, compuesto por fideos cocidos al dente, como spaghetti o penne, generosamente bañados en una salsa rica y sabrosa. Las opciones de salsa varían desde una tradicional marinara, cargada de tomates frescos y hierbas aromáticas, hasta una cremosa salsa Alfredo con un toque suave de ajo y queso parmesano. Este plato se puede personalizar con adiciones como albóndigas, verduras asadas o mariscos, convirtiéndolo en una comida versátil y satisfactoria"
    },
    "product_10": {
      "titulo": "Pay de queso",
      "descripcion": "El pay de queso, también conocido como cheesecake en inglés, es un postre sumamente popular en todo el mundo. Su origen se remonta a la antigua Grecia, donde se preparaba una versión más simple con queso fresco, miel y trigo. Con el tiempo, esta delicia ha evolucionado y se ha convertido en una variedad de sabores y estilos."
    },
    "product_11": {
      "titulo": "Sopa de Vegetales",
      "descripcion": "La sopa de verdura es un plato saludable y reconfortante que consiste en una variedad de vegetales cocidos en caldo. Los ingredientes comunes incluyen zanahorias, papas, cebollas, apio, tomates y espinacas, aunque puede adaptarse según la disponibilidad y preferencia. Se sazona con hierbas y especias como ajo, perejil, tomillo y laurel. Es nutritiva, baja en calorías y rica en vitaminas, minerales y fibra, ideal para una alimentación equilibrada."
    },
    "product_12": {
      "titulo": "Flan",
      "descripcion": "El flan de huevo es un postre tradicional y popular en muchas culturas alrededor del mundo. Es un postre de textura suave y delicada, hecho principalmente con huevos, leche y azúcar, aunque pueden haber variaciones en los ingredientes y métodos de preparación según la región."
    }
  },
  "orderConfirmation": {
    "title": "Orden Creada",
    "successMessage": "Su orden fue creada correctamente",
    "redirectMessage": "Volviendo al menú principal"
  },
  "signin": {
    "title": "Iniciar Sesión",
    "emailPlaceholder": "Correo electrónico",
    "passwordPlaceholder": "Contraseña",
    "rememberMe": "Recordarme",
    "forgotPassword": "¿Olvidaste tu contraseña?",
    "signInButton": "Entrar",
    "noAccount": "¿No tienes cuenta?",
    "register": "Regístrate",
    "orSignInWith": "o inicia sesión con",
    "success": "Inicio de sesión exitoso",
    "errorLoggingIn": "Error al iniciar sesión",
    "errors": {
      "auth/user-not-found": "Usuario no encontrado",
      "auth/wrong-password": "Contraseña incorrecta",
      "auth/too-many-requests": "Demasiados intentos, intenta más tarde",
      "default": "Ocurrió un error. Por favor, inténtalo de nuevo."
    }
  },
  "signup": {
    "title": "Registrarse",
    "emailPlaceholder": "Correo electrónico",
    "passwordPlaceholder": "Contraseña",
    "rememberMe": "Recordarme",
    "forgotPassword": "¿Olvidaste tu contraseña?",
    "registerButton": "Registrarse",
    "alreadyHaveAccount": "¿Ya tienes cuenta?",
    "signIn": "Iniciar Sesión",
    "orSignInWith": "o regístrate con",
    "success": "Cuenta creada exitosamente",
    "errorLoggingIn": "Error al crear la cuenta",
    "errors": {
      "auth/email-already-in-use": "El correo ya está en uso",
      "auth/invalid-email": "Correo electrónico inválido",
      "auth/weak-password": "Contraseña débil, mínimo 6 caracteres",
      "default": "Ocurrió un error. Por favor, inténtalo de nuevo."
    }
  },
  "myProfile": "Mi Perfil",
  "profileTitle": "Mi Perfil",
  "userDetails": "Detalles del Usuario",
  "email": "Correo Electrónico",
  "changePassword": "Cambiar Contraseña",
  "currentPassword": "Contraseña Actual",
  "newPassword": "Nueva Contraseña",
  "updatePassword": "Actualizar Contraseña",
  "purchaseHistory": "Historial de Compras",
  "noPurchases": "No se encontró historial de compras.",
  "errorPassword": "No se pudo actualizar la contraseña. Verifica tu contraseña actual.",
  "successPassword": "¡Contraseña actualizada con éxito!",
  "firstName": "Nombre",
  "lastName": "Apellido",
  "updateName": "Actualizar Nombre",
  "errorName": "Por favor ingresa tanto el nombre como el apellido.",
  "successName": "¡Nombre actualizado con éxito!",
  "userNotFound": "Usuario no encontrado en la base de datos.",
  "contactUs": {
    "title": "Contáctenos",
    "emailPlaceholder": "Correo electrónico",
    "subjectPlaceholder": "Asunto",
    "messagePlaceholder": "Mensaje",
    "sendButton": "Enviar"
  }

}
